// import { logger } from "@txpjs/utils-node";

// 开建筑，升使馆，升

function 装备() {
  /**
   * 28 5
   * 38 10
   * 58 20
   */
  const 绿色 = [
    {
      名称: '绿色',
      等级: 7,
      升级所需经验: 45,
      当前战力: 3121,
      升级后战力: 3400,
    },
  ];
  console.log(计算(绿色, 7));
  const 蓝色 = [
    {
      名称: '蓝色',
      等级: 8,
      升级所需经验: 50,
      当前战力: 4030,
      升级后战力: 4387,
    },
    {
      名称: '蓝色',
      等级: 7,
      升级所需经验: 45,
      当前战力: 3688,
      升级后战力: 4030,
    },
    {
      名称: '蓝色',
      等级: 6,
      升级所需经验: 40,
      当前战力: 3363,
      升级后战力: 3688,
    },
    {
      名称: '蓝色',
      等级: 5,
      升级所需经验: 35,
      当前战力: 3055,
      升级后战力: 3363,
    },
    {
      名称: '蓝色',
      等级: 4,
      升级所需经验: 30,
      当前战力: 2746,
      升级后战力: 3055,
    },
    {
      名称: '蓝色',
      等级: 10,
      升级所需经验: 60,
      当前战力: 4761,
      升级后战力: 5135,
    },
    {
      名称: '蓝色',
      等级: 16,
      升级所需经验: 90,
      当前战力: 7231,
      升级后战力: 7686,
    },
    {
      名称: '蓝色',
      等级: 12,
      升级所需经验: 70,
      当前战力: 5525,
      升级后战力: 5931,
    },
  ];
  console.log(计算(蓝色, 8));
  const 紫色 = [
    {
      名称: '紫色',
      等级: 35,
      升级所需经验: 220,
      当前战力: 23600,
      升级后战力: 24640,
    },
    {
      名称: '紫色',
      等级: 12,
      升级所需经验: 70,
      当前战力: 6800,
      升级后战力: 7300,
    },
    {
      名称: '紫色',
      等级: 34,
      升级所需经验: 210,
      当前战力: 22580,
      升级后战力: 23600,
    },
    {
      名称: '紫色',
      等级: 33,
      升级所需经验: 200,
      当前战力: 21600,
      升级后战力: 22580,
    },
    {
      名称: '紫色',
      等级: 32,
      升级所需经验: 190,
      当前战力: 20660,
      升级后战力: 21600,
    },
    {
      名称: '紫色',
      等级: 31,
      升级所需经验: 180,
      当前战力: 19740,
      升级后战力: 20660,
    },
    {
      名称: '紫色',
      等级: 30,
      升级所需经验: 170,
      当前战力: 18840,
      升级后战力: 19740,
    },
    {
      名称: '紫色',
      等级: 28,
      升级所需经验: 150,
      当前战力: 17140,
      升级后战力: 17980,
    },
    {
      名称: '紫色',
      等级: 20,
      升级所需经验: 110,
      当前战力: 11300,
      升级后战力: 11940,
    },
    {
      名称: '紫色',
      等级: 8,
      升级所需经验: 50,
      当前战力: 4960,
      升级后战力: 5400,
    },
  ];
  console.log(计算(紫色, 12));

  const 橙色 = [
    {
      名称: '橙色',
      等级: 42,
      升级所需经验: 330,
      当前战力: 39525,
      升级后战力: 41125,
    },
    {
      名称: '橙色',
      等级: 41,
      升级所需经验: 310,
      当前战力: 37950,
      升级后战力: 39525,
    },
    {
      名称: '橙色',
      等级: 40,
      升级所需经验: 290,
      当前战力: 36425,
      升级后战力: 37950,
    },
    {
      名称: '橙色',
      等级: 39,
      升级所需经验: 270,
      当前战力: 34950,
      升级后战力: 36425,
    },
    {
      名称: '橙色',
      等级: 38,
      升级所需经验: 250,
      当前战力: 33525,
      升级后战力: 34950,
    },
    {
      名称: '橙色',
      等级: 30,
      升级所需经验: 170,
      当前战力: 23550,
      升级后战力: 24675,
    },
    {
      名称: '橙色',
      等级: 20,
      升级所需经验: 110,
      当前战力: 14125,
      升级后战力: 14925,
    },
    {
      名称: '橙色',
      等级: 16,
      升级所需经验: 90,
      当前战力: 11125,
      升级后战力: 11825,
    },
  ];
  console.log(计算(橙色, 16));
  const 橙色专精1 = [
    {
      名称: '橙色专精1',
      等级: 48,
      升级所需经验: 450,
      当前战力: 54917,
      升级后战力: 57035,
    },
    {
      名称: '橙色专精1',
      等级: 47,
      升级所需经验: 430,
      当前战力: 52882,
      升级后战力: 54917,
    },
    {
      名称: '橙色专精1',
      等级: 46,
      升级所需经验: 410,
      当前战力: 50875,
      升级后战力: 52882,
    },
    {
      名称: '橙色专精1',
      等级: 45,
      升级所需经验: 390,
      当前战力: 48950,
      升级后战力: 50875,
    },
    {
      名称: '橙色专精1',
      等级: 44,
      升级所需经验: 370,
      当前战力: 47052,
      升级后战力: 48950,
    },
    {
      名称: '橙色专精1',
      等级: 43,
      升级所需经验: 350,
      当前战力: 45237,
      升级后战力: 47052,
    },
    {
      名称: '橙色专精1',
      等级: 42,
      升级所需经验: 330,
      当前战力: 43477,
      升级后战力: 45237,
    },
    {
      名称: '橙色专精1',
      等级: 40,
      升级所需经验: 290,
      当前战力: 40067,
      升级后战力: 41745,
    },
    {
      名称: '橙色专精1',
      等级: 38,
      升级所需经验: 250,
      当前战力: 36877,
      升级后战力: 38445,
    },
    {
      名称: '橙色专精1',
      等级: 33,
      升级所需经验: 200,
      当前战力: 29700,
      升级后战力: 31047,
    },
    {
      名称: '橙色专精1',
      等级: 30,
      升级所需经验: 170,
      当前战力: 25905,
      升级后战力: 27142,
    },

    {
      名称: '橙色专精1',
      等级: 20,
      升级所需经验: 110,
      当前战力: 15537,
      升级后战力: 16417,
    },
  ];
  console.log(计算(橙色专精1, 50));
  const 橙色专精2 = [
    {
      名称: '橙色专精2',
      等级: 63,
      升级所需经验: 800,
      当前战力: 102570,
      升级后战力: 106110,
    },
    {
      名称: '橙色专精2',
      等级: 60,
      升级所需经验: 710,
      当前战力: 92520,
      升级后战力: 95790,
    },
    {
      名称: '橙色专精2',
      等级: 58,
      升级所需经验: 650,
      当前战力: 86280,
      升级后战力: 89370,
    },
    {
      名称: '橙色专精2',
      等级: 54,
      升级所需经验: 570,
      当前战力: 74820,
      升级后战力: 77550,
    },
    {
      名称: '橙色专精2',
      等级: 28,
      升级所需经验: 150,
      当前战力: 25710,
      升级后战力: 26970,
    },
    {
      名称: '橙色专精2',
      等级: 53,
      升级所需经验: 550,
      当前战力: 72150,
      升级后战力: 74820,
    },
    {
      名称: '橙色专精2',
      等级: 52,
      升级所需经验: 530,
      当前战力: 69570,
      升级后战力: 72150,
    },
    {
      名称: '橙色专精2',
      等级: 51,
      升级所需经验: 510,
      当前战力: 67050,
      升级后战力: 69570,
    },
    {
      名称: '橙色专精2',
      等级: 50,
      升级所需经验: 490,
      当前战力: 64590,
      升级后战力: 67050,
    },
    {
      名称: '橙色专精2',
      等级: 49,
      升级所需经验: 470,
      当前战力: 62220,
      升级后战力: 64590,
    },
    {
      名称: '橙色专精2',
      等级: 48,
      升级所需经验: 450,
      当前战力: 59910,
      升级后战力: 62220,
    },
    {
      名称: '橙色专精2',
      等级: 47,
      升级所需经验: 430,
      当前战力: 57690,
      升级后战力: 59910,
    },
    {
      名称: '橙色专精2',
      等级: 46,
      升级所需经验: 410,
      当前战力: 55500,
      升级后战力: 57690,
    },
    {
      名称: '橙色专精2',
      等级: 44,
      升级所需经验: 370,
      当前战力: 51330,
      升级后战力: 53400,
    },
    {
      名称: '橙色专精2',
      等级: 43,
      升级所需经验: 350,
      当前战力: 49350,
      升级后战力: 51330,
    },
    {
      名称: '橙色专精2',
      等级: 42,
      升级所需经验: 330,
      当前战力: 47430,
      升级后战力: 49350,
    },
    {
      名称: '橙色专精2',
      等级: 40,
      升级所需经验: 290,
      当前战力: 43710,
      升级后战力: 45540,
    },
    {
      名称: '橙色专精2',
      等级: 38,
      升级所需经验: 250,
      当前战力: 40230,
      升级后战力: 41940,
    },
    {
      名称: '橙色专精2',
      等级: 33,
      升级所需经验: 200,
      当前战力: 32400,
      升级后战力: 33870,
    },
    {
      名称: '橙色专精2',
      等级: 30,
      升级所需经验: 170,
      当前战力: 28260,
      升级后战力: 29610,
    },
    {
      名称: '橙色专精2',
      等级: 20,
      升级所需经验: 110,
      当前战力: 16950,
      升级后战力: 17910,
    },
  ];
  console.log(计算(橙色专精2, 63));
  const 橙色专精3 = [
    {
      名称: '橙色专精3',
      等级: 72,
      升级所需经验: 1110,
      当前战力: 149857,
      升级后战力: 154765,
    },
    {
      名称: '橙色专精3',
      等级: 70,
      升级所需经验: 1030,
      当前战力: 140400,
      升级后战力: 145047,
    },
    {
      名称: '橙色专精3',
      等级: 65,
      升级所需经验: 860,
      当前战力: 118917,
      升级后战力: 122980,
    },
    {
      名称: '橙色专精3',
      等级: 63,
      升级所需经验: 800,
      当前战力: 111117,
      升级后战力: 114952,
    },
    {
      名称: '橙色专精3',
      等级: 61,
      升级所需经验: 740,
      当前战力: 103772,
      升级后战力: 107380,
    },
    {
      名称: '橙色专精3',
      等级: 60,
      升级所需经验: 710,
      当前战力: 100230,
      升级后战力: 103772,
    },
    {
      名称: '橙色专精3',
      等级: 59,
      升级所需经验: 670,
      当前战力: 96817,
      升级后战力: 100230,
    },
    {
      名称: '橙色专精3',
      等级: 58,
      升级所需经验: 650,
      当前战力: 93470,
      升级后战力: 96817,
    },
    {
      名称: '橙色专精3',
      等级: 57,
      升级所需经验: 630,
      当前战力: 90220,
      升级后战力: 93470,
    },
    {
      名称: '橙色专精3',
      等级: 56,
      升级所需经验: 610,
      当前战力: 87100,
      升级后战力: 90220,
    },
    {
      名称: '橙色专精3',
      等级: 55,
      升级所需经验: 590,
      当前战力: 84012,
      升级后战力: 87100,
    },
    {
      名称: '橙色专精3',
      等级: 54,
      升级所需经验: 570,
      当前战力: 81055,
      升级后战力: 84012,
    },
    {
      名称: '橙色专精3',
      等级: 53,
      升级所需经验: 550,
      当前战力: 78162,
      升级后战力: 81055,
    },
    {
      名称: '橙色专精3',
      等级: 52,
      升级所需经验: 530,
      当前战力: 75367,
      升级后战力: 78162,
    },
    {
      名称: '橙色专精3',
      等级: 50,
      升级所需经验: 490,
      当前战力: 69972,
      升级后战力: 72637,
    },
    {
      名称: '橙色专精3',
      等级: 49,
      升级所需经验: 470,
      当前战力: 67405,
      升级后战力: 69972,
    },
    {
      名称: '橙色专精3',
      等级: 48,
      升级所需经验: 450,
      当前战力: 64902,
      升级后战力: 67405,
    },
    {
      名称: '橙色专精3',
      等级: 41,
      升级所需经验: 310,
      当前战力: 49335,
      升级后战力: 51382,
    },
    {
      名称: '橙色专精3',
      等级: 46,
      升级所需经验: 410,
      当前战力: 60125,
      升级后战力: 62497,
    },
    {
      名称: '橙色专精3',
      等级: 44,
      升级所需经验: 370,
      当前战力: 55607,
      升级后战力: 57850,
    },
    {
      名称: '橙色专精3',
      等级: 38,
      升级所需经验: 250,
      当前战力: 43582,
      升级后战力: 45435,
    },
    {
      名称: '橙色专精3',
      等级: 36,
      升级所需经验: 230,
      当前战力: 40040,
      升级后战力: 41795,
    },
    {
      名称: '橙色专精3',
      等级: 30,
      升级所需经验: 170,
      当前战力: 30615,
      升级后战力: 32077,
    },
    {
      名称: '橙色专精3',
      等级: 28,
      升级所需经验: 150,
      当前战力: 27852,
      升级后战力: 29217,
    },
    {
      名称: '橙色专精3',
      等级: 21,
      升级所需经验: 115,
      当前战力: 19402,
      升级后战力: 20507,
    },
    {
      名称: '橙色专精3',
      等级: 20,
      升级所需经验: 110,
      当前战力: 18362,
      升级后战力: 19402,
    },
  ];
  console.log(计算(橙色专精3, 72));
  const 橙色专精4 = [
    {
      名称: '橙色专精3',
      等级: 83,
      升级所需经验: 1600,
      当前战力: 228515,
      升级后战力: 235690,
    },
    {
      名称: '橙色专精3',
      等级: 80,
      升级所需经验: 1450,
      当前战力: 208180,
      升级后战力: 214795,
    },
    {
      名称: '橙色专精3',
      等级: 75,
      升级所需经验: 1230,
      当前战力: 177730,
      升级后战力: 183505,
    },
    {
      名称: '橙色专精3',
      等级: 70,
      升级所需经验: 1030,
      当前战力: 151200,
      升级后战力: 156205,
    },
    {
      名称: '橙色专精3',
      等级: 69,
      升级所需经验: 990,
      当前战力: 146300,
      升级后战力: 151200,
    },
    {
      名称: '橙色专精3',
      等级: 68,
      升级所需经验: 950,
      当前战力: 141540,
      升级后战力: 146300,
    },
    {
      名称: '橙色专精3',
      等级: 66,
      升级所需经验: 890,
      当前战力: 132440,
      升级后战力: 136920,
    },
    {
      名称: '橙色专精3',
      等级: 65,
      升级所需经验: 860,
      当前战力: 128065,
      升级后战力: 132440,
    },
  ];
  console.log(计算(橙色专精4, 83));
  function 计算(颜色, 等级) {
    const 颜色等级 = 颜色.find((a) => a.等级 === 等级);
    if (颜色等级) {
      const obj = 颜色等级;
      const 每点经验提升战力 =
        (obj.升级后战力 - obj.当前战力) / obj.升级所需经验;
      return `等级：${obj.等级}，${obj.名称}每点经验提升战力为${每点经验提升战力}`;
    }
    return `等级：${等级}，等级错误`;
  }

  return;
}

function 燃霜() {
  const 一级矿 = 8; //8每秒，每分钟480
  const 二级矿 = 16; //16每秒 ，每分钟960
  const 三级矿 = 32; //32每秒，每分钟1920
  const 迸发矿 = 200; //200每秒
  const 分数 = 一级矿 * 60 * 30 * 4 + 20 * 1500;
  console.log(分数);
  /**
   * 二级野怪 150经验 以及野怪 75经验
   * 200一技能 每分钟 1080 ，打怪一个1500 ，28分钟30240 ，打20个怪
   * 500二技 出征数量增加12000， 能行军快25%
   * 900三技能 成功普通矿脉一分钟5000，失败一次5000
   * 1500四技能 获得奥利哈刚效率增加15% ，英雄恢复时间缩短30%
   * 2300五技能 一分钟提高穿透66% 一分钟挖矿速度提升50% cd 5分钟
   * 360秒一个迁城
   * 16点 164人
   */
}

function 装备计算() {
  const 初始橙色 = [
    {
      等级: 100,
      升级所需经验: 0,
      战力: 271675,
    },
    {
      等级: 99,
      升级所需经验: 2400,
      战力: 263850,
    },
    {
      等级: 98,
      升级所需经验: 2350,
      战力: 256250,
    },
    {
      等级: 97,
      升级所需经验: 2300,
      战力: 248825,
    },
    {
      等级: 96,
      升级所需经验: 2250,
      战力: 241625,
    },
    {
      等级: 95,
      升级所需经验: 2200,
      战力: 234575,
    },
    {
      等级: 94,
      升级所需经验: 2150,
      战力: 227725,
    },
    {
      等级: 93,
      升级所需经验: 2100,
      战力: 221050,
    },
    {
      等级: 92,
      升级所需经验: 2050,
      战力: 214550,
    },
    {
      等级: 91,
      升级所需经验: 2000,
      战力: 208225,
    },
    {
      等级: 90,
      升级所需经验: 1950,
      战力: 202075,
    },
    {
      等级: 89,
      升级所需经验: 1900,
      战力: 196075,
    },
    {
      等级: 88,
      升级所需经验: 1850,
      战力: 190225,
    },
    {
      等级: 87,
      升级所需经验: 1800,
      战力: 184525,
    },
    {
      等级: 86,
      升级所需经验: 1750,
      战力: 179000,
    },
    {
      等级: 85,
      升级所需经验: 1700,
      战力: 173600,
    },
    {
      等级: 84,
      升级所需经验: 1650,
      战力: 168350,
    },
    {
      等级: 83,
      升级所需经验: 1600,
      战力: 163225,
    },
    {
      等级: 82,
      升级所需经验: 1550,
      战力: 158250,
    },
    {
      等级: 81,
      升级所需经验: 1500,
      战力: 153425,
    },
    {
      等级: 80,
      升级所需经验: 1450,
      战力: 148700,
    },
    {
      等级: 79,
      升级所需经验: 1400,
      战力: 144100,
    },
    {
      等级: 78,
      升级所需经验: 1350,
      战力: 139650,
    },
    {
      等级: 77,
      升级所需经验: 1310,
      战力: 135300,
    },
    {
      等级: 76,
      升级所需经验: 1270,
      战力: 131075,
    },
    {
      等级: 75,
      升级所需经验: 1230,
      战力: 126950,
    },
    {
      等级: 74,
      升级所需经验: 1190,
      战力: 122950,
    },
    {
      等级: 73,
      升级所需经验: 1150,
      战力: 119050,
    },
    {
      等级: 72,
      升级所需经验: 1110,
      战力: 115275,
    },
    {
      等级: 71,
      升级所需经验: 1070,
      战力: 111575,
    },
    {
      等级: 70,
      升级所需经验: 1030,
      战力: 108000,
    },
    {
      等级: 69,
      升级所需经验: 990,
      战力: 104500,
    },
    {
      等级: 68,
      升级所需经验: 940,
      战力: 101100,
    },
    {
      等级: 67,
      升级所需经验: 920,
      战力: 97800,
    },
    {
      等级: 66,
      升级所需经验: 890,
      战力: 94600,
    },
    {
      等级: 65,
      升级所需经验: 860,
      战力: 91475,
    },
    {
      等级: 64,
      升级所需经验: 830,
      战力: 88425,
    },
    {
      等级: 63,
      升级所需经验: 800,
      战力: 85475,
    },
    {
      等级: 62,
      升级所需经验: 770,
      战力: 82600,
    },
    {
      等级: 61,
      升级所需经验: 740,
      战力: 79825,
    },
    {
      等级: 60,
      升级所需经验: 710,
      战力: 77100,
    },
    {
      等级: 59,
      升级所需经验: 680,
      战力: 74475,
    },
    {
      等级: 58,
      升级所需经验: 650,
      战力: 71900,
    },
    {
      等级: 57,
      升级所需经验: 630,
      战力: 69400,
    },
    {
      等级: 56,
      升级所需经验: 610,
      战力: 67000,
    },
    {
      等级: 55,
      升级所需经验: 590,
      战力: 64625,
    },
    {
      等级: 54,
      升级所需经验: 570,
      战力: 62350,
    },
    {
      等级: 53,
      升级所需经验: 550,
      战力: 60125,
    },
    {
      等级: 52,
      升级所需经验: 530,
      战力: 57975,
    },
    {
      等级: 51,
      升级所需经验: 510,
      战力: 55875,
    },
    {
      等级: 50,
      升级所需经验: 490,
      战力: 53825,
    },
    {
      等级: 49,
      升级所需经验: 470,
      战力: 51850,
    },
    {
      等级: 48,
      升级所需经验: 450,
      战力: 49925,
    },
    {
      等级: 47,
      升级所需经验: 430,
      战力: 48075,
    },
    {
      等级: 46,
      升级所需经验: 410,
      战力: 46250,
    },
    {
      等级: 45,
      升级所需经验: 390,
      战力: 44500,
    },
    {
      等级: 44,
      升级所需经验: 370,
      战力: 42775,
    },
    {
      等级: 43,
      升级所需经验: 350,
      战力: 41125,
    },
    {
      等级: 42,
      升级所需经验: 330,
      战力: 39525,
    },
    {
      等级: 41,
      升级所需经验: 310,
      战力: 37950,
    },
    {
      等级: 40,
      升级所需经验: 290,
      战力: 36425,
    },
    {
      等级: 39,
      升级所需经验: 270,
      战力: 34950,
    },
    {
      等级: 38,
      升级所需经验: 250,
      战力: 33525,
    },
    {
      等级: 37,
      升级所需经验: 240,
      战力: 32150,
    },
    {
      等级: 36,
      升级所需经验: 230,
      战力: 30800,
    },
    {
      等级: 35,
      升级所需经验: 220,
      战力: 29500,
    },
    {
      等级: 34,
      升级所需经验: 210,
      战力: 28225,
    },
    {
      等级: 33,
      升级所需经验: 200,
      战力: 27000,
    },
    {
      等级: 32,
      升级所需经验: 190,
      战力: 25825,
    },
    {
      等级: 31,
      升级所需经验: 180,
      战力: 24675,
    },
    {
      等级: 30,
      升级所需经验: 170,
      战力: 23550,
    },
    {
      等级: 29,
      升级所需经验: 160,
      战力: 22475,
    },
    {
      等级: 28,
      升级所需经验: 150,
      战力: 21425,
    },
    {
      等级: 27,
      升级所需经验: 145,
      战力: 20400,
    },
    {
      等级: 26,
      升级所需经验: 140,
      战力: 19400,
    },
    {
      等级: 25,
      升级所需经验: 135,
      战力: 18450,
    },
    {
      等级: 24,
      升级所需经验: 130,
      战力: 17525,
    },
    {
      等级: 23,
      升级所需经验: 125,
      战力: 16625,
    },
    {
      等级: 22,
      升级所需经验: 120,
      战力: 15775,
    },
    {
      等级: 21,
      升级所需经验: 115,
      战力: 14925,
    },
    {
      等级: 20,
      升级所需经验: 110,
      战力: 14125,
    },
    {
      等级: 19,
      升级所需经验: 105,
      战力: 13325,
    },
    {
      等级: 18,
      升级所需经验: 100,
      战力: 12575,
    },
    {
      等级: 17,
      升级所需经验: 95,
      战力: 11825,
    },
    {
      等级: 16,
      升级所需经验: 90,
      战力: 11125,
    },
    {
      等级: 15,
      升级所需经验: 85,
      战力: 10425,
    },
    {
      等级: 14,
      升级所需经验: 80,
      战力: 9775,
    },
    {
      等级: 13,
      升级所需经验: 75,
      战力: 9125,
    },
    {
      等级: 12,
      升级所需经验: 70,
      战力: 8500,
    },
    {
      等级: 11,
      升级所需经验: 65,
      战力: 7900,
    },
    {
      等级: 10,
      升级所需经验: 60,
      战力: 7325,
    },
    {
      等级: 9,
      升级所需经验: 55,
      战力: 6750,
    },
    {
      等级: 8,
      升级所需经验: 50,
      战力: 6200,
    },
    {
      等级: 7,
      升级所需经验: 45,
      战力: 5675,
    },
    {
      等级: 6,
      升级所需经验: 40,
      战力: 5175,
    },
    {
      等级: 5,
      升级所需经验: 35,
      战力: 4700,
    },
    {
      等级: 4,
      升级所需经验: 30,
      战力: 4225,
    },
    {
      等级: 3,
      升级所需经验: 25,
      战力: 3775,
    },
    {
      等级: 2,
      升级所需经验: 20,
      战力: 3325,
    },
    {
      等级: 1,
      升级所需经验: 15,
      战力: 2900,
    },
    {
      等级: 0,
      升级所需经验: 10,
      战力: 2500,
    },
  ];
  function 计算装备等级经验(装备等级: number) {
    let 经验 = 0;
    初始橙色.forEach((item) => {
      const { 等级, 升级所需经验 } = item;
      if (装备等级 > 等级) {
        经验 = 经验 + 升级所需经验;
      }
    });
    return 经验;
  }
  function 装备战力计算(专精加成, 等级) {
    const 战力 =
      (初始橙色.find((item) => item.等级 === 等级)?.战力 || 0) * 专精加成;
    return Number(战力.toFixed(0));
  }

  const 装备数据1 = [
    {
      装备名称: '盾护手1',
      加成: 1.4,
      当前等级: 0,
      升级后等级: 88,
    },
    {
      装备名称: '射鞋子1',
      加成: 1.3,
      当前等级: 0,
      升级后等级: 79,
    },
    {
      装备名称: '矛目镜1',
      加成: 1.2,
      当前等级: 0,
      升级后等级: 71,
    },
    {
      装备名称: '射目镜1',
      加成: 1.2,
      当前等级: 0,
      升级后等级: 71,
    },
    {
      装备名称: '盾腰带1',
      加成: 1.2,
      当前等级: 0,
      升级后等级: 71,
    },
    {
      装备名称: '矛鞋子1',
      加成: 1.2,
      当前等级: 0,
      升级后等级: 71,
    },
  ];
  const 装备数据2 = [
    {
      装备名称: '盾护手1',
      加成: 1.4,
      当前等级: 0,
      升级后等级: 85,
    },
    {
      装备名称: '射鞋子1',
      加成: 1.3,
      当前等级: 0,
      升级后等级: 76,
    },
    {
      装备名称: '矛目镜1',
      加成: 1.2,
      当前等级: 0,
      升级后等级: 68,
    },
    {
      装备名称: '射目镜1',
      加成: 1.2,
      当前等级: 0,
      升级后等级: 68,
    },
    {
      装备名称: '盾腰带1',
      加成: 1.2,
      当前等级: 0,
      升级后等级: 68,
    },
    {
      装备名称: '矛鞋子1',
      加成: 1.2,
      当前等级: 0,
      升级后等级: 68,
    },
    {
      装备名称: '射鞋子2',
      加成: 1,
      当前等级: 0,
      升级后等级: 54,
    },
    {
      装备名称: '盾护手2',
      加成: 1,
      当前等级: 0,
      升级后等级: 54,
    },
  ];
  const 装备数据3 = [
    {
      装备名称: '盾护手1',
      加成: 1.7,
      当前等级: 0,
      升级后等级: 100,
    },
    {
      装备名称: '射目镜1',
      加成: 1.5,
      当前等级: 0,
      升级后等级: 81,
    },
    {
      装备名称: '射鞋子1',
      加成: 1.4,
      当前等级: 0,
      升级后等级: 74,
    },
    {
      装备名称: '盾腰带1',
      加成: 1.4,
      当前等级: 0,
      升级后等级: 74,
    },
    {
      装备名称: '矛目镜1',
      加成: 1.4,
      当前等级: 0,
      升级后等级: 74,
    },

    {
      装备名称: '矛鞋子1',
      加成: 1.3,
      当前等级: 0,
      升级后等级: 67,
    },
    {
      装备名称: '盾鞋子1',
      加成: 1.2,
      当前等级: 0,
      升级后等级: 61,
    },
    {
      装备名称: '盾目镜1',
      加成: 1.1,
      当前等级: 0,
      升级后等级: 54,
    },
    {
      装备名称: '射护手1',
      加成: 1.1,
      当前等级: 0,
      升级后等级: 54,
    },
    {
      装备名称: '射腰带1',
      加成: 1.1,
      当前等级: 0,
      升级后等级: 54,
    },
    {
      装备名称: '射鞋子2',
      加成: 1.1,
      当前等级: 0,
      升级后等级: 54,
    },
    {
      装备名称: '矛护手1',
      加成: 1,
      当前等级: 0,
      升级后等级: 49,
    },
    {
      装备名称: '矛腰带1',
      加成: 1,
      当前等级: 0,
      升级后等级: 49,
    },
    {
      装备名称: '盾护手2',
      加成: 1,
      当前等级: 0,
      升级后等级: 49,
    },
    {
      装备名称: '盾腰带2',
      加成: 1,
      当前等级: 0,
      升级后等级: 49,
    },
  ];
  const 经验 = 17684 * 10;

  function 经验方案(装备数据, 经验) {
    console.log('方案：');
    let 总战力 = 0;
    let 所需要经验 = 0;
    装备数据.forEach((item) => {
      if (!item.不计算) {
        const 当前战力 = 装备战力计算(item.加成, item.当前等级);
        const 升级后战力 = 装备战力计算(item.加成, item.升级后等级);
        const 升级1后战力 = 装备战力计算(item.加成, item.升级后等级 + 1);
        const 战力差 = 升级后战力 - 当前战力;
        const 战力差1 = 升级1后战力 - 当前战力;
        const 当前等级经验 = 计算装备等级经验(item.当前等级);
        const 升级后等级经验 = 计算装备等级经验(item.升级后等级);
        const 升级1后等级经验 = 计算装备等级经验(item.升级后等级 + 1);
        const 经验差 = 升级后等级经验 - 当前等级经验;
        const 经验差1 = 升级1后等级经验 - 当前等级经验;
        所需要经验 = 所需要经验 + 经验差;
        总战力 = 总战力 + 升级后战力;
        console.log(
          item.装备名称,
          '加成-' + item.加成.toFixed(1),
          '等级-' + item.升级后等级,
          ((战力差 / 经验差) * 100).toFixed(2),
          ((战力差1 / 经验差1) * 100).toFixed(2),
        );
      }
    });
    console.log('总战力', 总战力);
    console.log('还剩经验', 经验 - 所需要经验);
    return 总战力;
  }
  const 方案1 = 经验方案(装备数据3, 经验);
  // const 方案2 = 经验方案(装备数据1, 经验);
  // console.log("方案差距", 方案1 - 方案2);
  // 经验方案(装备数据1, 经验);
}

async function main() {
  // 构造百度web服务API的URL
  const rootUrl = 'https://api.map.baidu.com/geocoding/v3?'; // 根URL
  const baiduApiKey = 'C620Ze2qD9T7PgH61GYGF0GW3lnw5xEG';
  // 设置终点
  const destination = '30.721707286481262,104.0679510412832';
  const url =
    rootUrl +
    'output=json' +
    '&ak=' +
    baiduApiKey +
    '&address=' +
    encodeURIComponent(address);
  const res1 = await fetch(url, { method: 'GET' });
  const location = (await res1.json()).result.location;
  const origin = `${location.lat},${location.lng}`;
  const transitUrl =
    'https://api.map.baidu.com/directionlite/v1/transit?' +
    'origin=' +
    origin +
    '&destination=' +
    destination +
    '&ak=' +
    baiduApiKey;
  const res2 = await fetch(transitUrl, { method: 'GET' });
  const routes = (await res2.json()).result.routes;
  const way = routes.sort((a, b) => a.duration - b.duration).at(0);
  console.log(
    `距离我还有${way.distance}米，公交过来要${way.duration / 60}分钟`,
  );
}
function 冲榜1() {
  const 目标分数1 = 362630;
  const 目标分数2 = 362630;
  const 我 = 320000;
  const 加分 = 158 * 2000;
  const 总 = 我 + 加分;
  console.log('冻土目标分数1', 目标分数1 - 总, 总);
  console.log('冻土目标分数2', 目标分数2 - 总, 总);
  return;
}
function 冲榜2() {
  const 目标分数1 = 5349870;
  const 目标分数2 = 0;

  const 我 = 4299624;

  const 碎片 = 200 * 1875;

  const 总 = 我 + 碎片;
  console.log('目标分数1', 目标分数1 - 总, 总);
  console.log('目标分数2', 目标分数2 - 总, 总);

  return;
}

装备计算();

function 国战() {
  const 第二次国战个人排行 = [
    { 排名: '004', 组织: '520', 分数转移: '', 名字: '初九', 分数: 46415575 },
    { 排名: '007', 组织: '520', 分数转移: '', 名字: '三大大', 分数: 38342564 },
    { 排名: '015', 组织: 'qqq', 分数转移: '', 名字: '皮E皮', 分数: 26607854 },
    { 排名: '016', 组织: 'one', 分数转移: '', 名字: '多多多', 分数: 26353856 },
    { 排名: '018', 组织: 'qqq', 分数转移: '', 名字: '皮皮猪', 分数: 24960538 },
    { 排名: '020', 组织: 'no2', 分数转移: '', 名字: '大混子', 分数: 24295752 },
    { 排名: '021', 组织: '520', 分数转移: '', 名字: '掌柜', 分数: 23438355 },
    {
      排名: '023',
      组织: 'one',
      分数转移: '',
      名字: '吃猫的鱼',
      分数: 22245450,
    },
    { 排名: '024', 组织: 'qqq', 分数转移: '', 名字: 'labubu', 分数: 21938847 },
    {
      排名: '025',
      组织: 'one',
      分数转移: '',
      名字: '樱木花道',
      分数: 21365110,
    },
    {
      排名: '027',
      组织: 'one',
      分数转移: '',
      名字: '风过林捎',
      分数: 20554151,
    },
    {
      排名: '028',
      组织: 'qqq',
      分数转移: '',
      名字: '茜茜公主',
      分数: 19818863,
    },
    { 排名: '029', 组织: 'qqq', 分数转移: '', 名字: '圣凯龙', 分数: 19699757 },
    { 排名: '030', 组织: 'qqq', 分数转移: '', 名字: '徐凤年', 分数: 19650877 },
    { 排名: '031', 组织: 'qqq', 分数转移: '', 名字: '小懒熊', 分数: 19345205 },
    { 排名: '033', 组织: 'avn', 分数转移: '', 名字: '悟空', 分数: 18755174 },
    {
      排名: '034',
      组织: 'one',
      分数转移: '',
      名字: '格伦弩歌',
      分数: 18614274,
    },
    { 排名: '035', 组织: '520', 分数转移: '', 名字: '大锤', 分数: 18175768 },
    {
      排名: '039',
      组织: 'avn',
      分数转移: '',
      名字: '人联复兴',
      分数: 17484478,
    },
    { 排名: '040', 组织: '520', 分数转移: '', 名字: '猫七', 分数: 16963600 },
    { 排名: '042', 组织: 'one', 分数转移: '', 名字: '唐冬', 分数: 16334108 },
    {
      排名: '043',
      组织: '520',
      分数转移: '大锤',
      名字: '大锤.小号',
      分数: 15937417,
    },
    { 排名: '044', 组织: 'one', 分数转移: '', 名字: '毛胖胖', 分数: 15923562 },
    {
      排名: '046',
      组织: '520',
      分数转移: '',
      名字: '意想不到结局',
      分数: 15629009,
    },
    { 排名: '048', 组织: 'avn', 分数转移: '', 名字: '想冬眠', 分数: 15427442 },
    { 排名: '050', 组织: 'one', 分数转移: '', 名字: '罗城主', 分数: 15324366 },
    { 排名: '053', 组织: 'one', 分数转移: '', 名字: 'qiubo', 分数: 14862837 },
    {
      排名: '056',
      组织: 'one',
      分数转移: '',
      名字: '阿尔特迷死',
      分数: 13840182,
    },
    { 排名: '059', 组织: '520', 分数转移: '', 名字: '郭源潮', 分数: 13573120 },
    {
      排名: '063',
      组织: 'avn',
      分数转移: '',
      名字: '专心工作不摸鱼',
      分数: 13068980,
    },
    {
      排名: '064',
      组织: 'avn',
      分数转移: '',
      名字: '划水摸鱼',
      分数: 12970691,
    },
    {
      排名: '071',
      组织: 'avn',
      分数转移: '',
      名字: '汽水加香草',
      分数: 12374195,
    },
    { 排名: '072', 组织: 'qqq', 分数转移: '', 名字: '小小猫', 分数: 12138621 },
    { 排名: '074', 组织: '520', 分数转移: '', 名字: '小贝', 分数: 12014588 },
    { 排名: '075', 组织: 'one', 分数转移: '', 名字: '哦尼酱', 分数: 11987780 },
    {
      排名: '076',
      组织: '520',
      分数转移: '',
      名字: 'lgshtesey',
      分数: 11804596,
    },
    { 排名: '081', 组织: '520', 分数转移: '', 名字: '尤北风', 分数: 11574946 },
    {
      排名: '082',
      组织: 'qqq',
      分数转移: '',
      名字: '时光可曾',
      分数: 11472415,
    },
    { 排名: '086', 组织: 'one', 分数转移: '', 名字: '渣男', 分数: 11184109 },
    { 排名: '087', 组织: '520', 分数转移: '', 名字: '愚者', 分数: 11173582 },
    {
      排名: '088',
      组织: 'one',
      分数转移: '',
      名字: '鸭梨山太大',
      分数: 11125968,
    },
    { 排名: '090', 组织: 'qqq', 分数转移: '', 名字: '王麻子', 分数: 11111260 },
    {
      排名: '095',
      组织: 'kkk',
      分数转移: '',
      名字: '六眼飞鱼',
      分数: 10917902,
    },
    {
      排名: '097',
      组织: '520',
      分数转移: '',
      名字: '大傅预言',
      分数: 10754899,
    },
    {
      排名: '098',
      组织: 'avn',
      分数转移: '',
      名字: '西装小流氓',
      分数: 10704375,
    },
    { 排名: '099', 组织: 'one', 分数转移: '', 名字: '百战', 分数: 10685002 },
    {
      排名: '101',
      组织: '520',
      分数转移: '',
      名字: '往事如风',
      分数: 10591672,
    },
    {
      排名: '102',
      组织: '520',
      分数转移: '',
      名字: '猫七的猫',
      分数: 10518170,
    },
    {
      排名: '105',
      组织: 'avn',
      分数转移: '',
      名字: '快乐小成成',
      分数: 10276535,
    },
    {
      排名: '106',
      组织: 'avn',
      分数转移: '',
      名字: '文心豆腐',
      分数: 10233540,
    },
    { 排名: '107', 组织: 'avn', 分数转移: '', 名字: '荣姿', 分数: 10230987 },
    { 排名: '108', 组织: '520', 分数转移: '', 名字: '微光', 分数: 10038538 },
    { 排名: '109', 组织: '520', 分数转移: '', 名字: '台州', 分数: 10027601 },
    {
      排名: '112',
      组织: 'qqq',
      分数转移: '',
      名字: '雪城蓝歌',
      分数: 10027601,
    },
    { 排名: '114', 组织: 'one', 分数转移: '', 名字: '吉祥止止', 分数: 9923389 },
    { 排名: '116', 组织: '520', 分数转移: '', 名字: '小二', 分数: 9752071 },
    { 排名: '117', 组织: 'avn', 分数转移: '', 名字: '老马', 分数: 9678070 },
    {
      排名: '118',
      组织: '520',
      分数转移: '愚者',
      名字: '愚者仓库',
      分数: 9638965,
    },
    { 排名: '119', 组织: 'one', 分数转移: '', 名字: '研习修仙', 分数: 9612049 },
    { 排名: '120', 组织: 'one', 分数转移: '', 名字: '贰广', 分数: 9541560 },
    {
      排名: '122',
      组织: 'qqq',
      分数转移: '皮皮猪',
      名字: '小皮皮猪',
      分数: 9459369,
    },
    { 排名: '126', 组织: 'qqq', 分数转移: '', 名字: '沉默寡言', 分数: 9347864 },
    { 排名: '127', 组织: '520', 分数转移: '', 名字: '夏天', 分数: 9232372 },
    { 排名: '128', 组织: 'avn', 分数转移: '', 名字: '雁言', 分数: 9123293 },
    { 排名: '131', 组织: 'qqq', 分数转移: '', 名字: '沉默是金', 分数: 9049341 },
    { 排名: '132', 组织: '520', 分数转移: '', 名字: '收租老', 分数: 9024276 },
    { 排名: '133', 组织: 'qqq', 分数转移: '', 名字: 'kk糕点', 分数: 9012975 },
    { 排名: '134', 组织: 'one', 分数转移: '', 名字: '罗马复兴', 分数: 8950979 },
    { 排名: '135', 组织: 'one', 分数转移: '', 名字: '寂静夜幕', 分数: 8908315 },
    {
      排名: '139',
      组织: '520',
      分数转移: '',
      名字: '社会你乔哥',
      分数: 8508752,
    },
    {
      排名: '140',
      组织: '520',
      分数转移: '三大大',
      名字: '五大大',
      分数: 8489658,
    },
    { 排名: '142', 组织: 'qqq', 分数转移: '', 名字: 'ayan', 分数: 8341173 },
    { 排名: '145', 组织: 'one', 分数转移: '', 名字: 'gzy1231', 分数: 8288606 },
    { 排名: '146', 组织: '520', 分数转移: '', 名字: '阿巴阿巴', 分数: 8282251 },
    {
      排名: '147',
      组织: '520',
      分数转移: '愚者',
      名字: '愚者仓库',
      分数: 8267689,
    },
    { 排名: '148', 组织: '520', 分数转移: '', 名字: '放纵灵魂', 分数: 8261854 },
    { 排名: '149', 组织: '520', 分数转移: '猫七', 名字: '穆王', 分数: 8206685 },
    { 排名: '150', 组织: 'kkk', 分数转移: '', 名字: '荒天帝', 分数: 8165882 },
    { 排名: '157', 组织: '520', 分数转移: '', 名字: '别打我啊', 分数: 7898284 },
    { 排名: '159', 组织: '520', 分数转移: '', 名字: '我的城堡', 分数: 7852646 },
    { 排名: '161', 组织: '520', 分数转移: '', 名字: '小开心', 分数: 7748436 },
    {
      排名: '164',
      组织: '520',
      分数转移: '尤北风',
      名字: '日落黄昏',
      分数: 7697203,
    },
    {
      排名: '165',
      组织: 'qqq',
      分数转移: '',
      名字: '尼罗河公主',
      分数: 7692788,
    },
    {
      排名: '167',
      组织: '520',
      分数转移: '',
      名字: '重生在h国',
      分数: 7651620,
    },
    { 排名: '168', 组织: 'one', 分数转移: '', 名字: '航海家', 分数: 7556844 },
    {
      排名: '170',
      组织: 'kkk',
      分数转移: '',
      名字: '瑞雪兆丰年',
      分数: 7505653,
    },
    { 排名: '171', 组织: 'avn', 分数转移: '', 名字: 'spencer', 分数: 7475284 },
    { 排名: '172', 组织: 'one', 分数转移: '', 名字: 'Peter', 分数: 7422394 },
    { 排名: '173', 组织: 'one', 分数转移: '', 名字: '雪飘人间', 分数: 7368778 },
    { 排名: '174', 组织: '520', 分数转移: '', 名字: 'sany', 分数: 7342209 },
    { 排名: '175', 组织: '520', 分数转移: '', 名字: 'zang', 分数: 7289781 },
    { 排名: '178', 组织: 'avn', 分数转移: '', 名字: '面包包', 分数: 7224265 },
    { 排名: '179', 组织: 'avn', 分数转移: '', 名字: 'alin', 分数: 7187101 },
    { 排名: '180', 组织: 'qqq', 分数转移: '', 名字: '大懒熊', 分数: 7150709 },
    {
      排名: '181',
      组织: '520',
      分数转移: '',
      名字: '路虎在等着我',
      分数: 7147065,
    },
    {
      排名: '182',
      组织: 'qqq',
      分数转移: '',
      名字: '皮皮皮（都瓦可印',
      分数: 7142904,
    },
    {
      排名: '186',
      组织: 'avn',
      分数转移: '',
      名字: '梦琪d路飞',
      分数: 7049081,
    },
    { 排名: '187', 组织: 'avn', 分数转移: '', 名字: '暗夜', 分数: 7047314 },
    { 排名: '188', 组织: '520', 分数转移: '', 名字: '十二', 分数: 6933710 },
    {
      排名: '190',
      组织: '520',
      分数转移: '',
      名字: '别来影响我',
      分数: 6897542,
    },
    {
      排名: '191',
      组织: 'avn',
      分数转移: '老马',
      名字: '挖矿老马',
      分数: 6884291,
    },
    { 排名: '192', 组织: '520', 分数转移: '', 名字: '陈平安', 分数: 6872604 },
    { 排名: '196', 组织: 'one', 分数转移: '', 名字: '嘎嘎部落', 分数: 6832255 },
    { 排名: '197', 组织: 'one', 分数转移: '', 名字: '花棉袄', 分数: 6825699 },
    { 排名: '198', 组织: 'avn', 分数转移: '', 名字: '手机', 分数: 6825353 },
    {
      排名: '200',
      组织: '520',
      分数转移: '猫七',
      名字: '猫七的气',
      分数: 6756667,
    },
  ];
  const 转移后排行 = 第二次国战个人排行.map((a, index, arr) => {
    const obj = { ...a, 原始分数: a.分数 };
    arr.forEach((item) => {
      if (item.分数转移 === a.名字) {
        obj.分数 = obj.分数 + item.分数;
      }
    });
    return obj;
  });

  let 总分1 = 0;
  let 人数 = 0;
  let str = '';
  转移后排行
    .filter((a) => !a.分数转移)
    .forEach((element) => {
      总分1 = element.分数 + 总分1;
      const 原始分数 =
        element.原始分数 !== element.分数
          ? `原始分数:${element.原始分数}，`
          : '';
      str =
        str +
        element.名字 +
        '，分数:' +
        element.分数 +
        '，' +
        原始分数 +
        '国战总分占比' +
        ((element.分数 / 2187660487) * 100).toFixed(2) +
        '%' +
        ' | ' +
        element.分数转移;
      人数 = 人数 + 1;
    });
  console.log(str);

  console.log('国战总分', 2187660487);
  console.log('国战对面总分', 2196359829);
  console.log(
    '分差占比',
    (((2196359829 - 2187660487) / 2187660487) * 100).toFixed(2) + '%',
  );

  console.log('前200人数', 人数);
  console.log('前200总分', 总分1);
  console.log(
    '前200总分占国战总分比例',
    ((总分1 / 2187660487) * 100).toFixed(2) + '%',
  );

  const x520 = 616547241;
  const xone = 523209549;
  const xavn = 394112503;
  const xqqq = 342743879;
  const xkkk = 167066440;
  const 联盟分数 = x520 + xone + xavn + xqqq + xkkk;
  function dy(a, b) {
    console.log(a, ((b / 联盟分数) * 100).toFixed(2) + '%');
  }
  dy('x520', x520);
  dy('xone', xone);
  dy('xavn', xavn);
  dy('xqqq', xqqq);
  dy('xkkk', xkkk);
  return;
  const a520 = 313796572;
  const one = 290566283;
  const avn = 182669057;
  const kkk = 91593721;
  const qqq = 24416610;
  const no2 = 16516530;
  const a996 = 12426650;
  const no1 = 4243100;
  const a = {
    '520 ': 313796572,
    'one ': 290566283,
    'avn ': 182669057,
    'kkk ': 91593721,
    'qqq ': 24416610,
    'no2 ': 16516530,
    '996 ': 12426650,
    'no1 ': 4243100,
  };
  let 总分 = 0;
  Object.entries(a).forEach(([key, value]) => {
    总分 = 总分 + value;
  });
  Object.entries(a).forEach(([key, value]) => {
    const 贡献 = ((value / 总分) * 100).toFixed(2);
    console.log(key, 贡献 + '%');
  });
}
