export default (
  <div>
    <h1>2808 堡垒规则</h1>
    <h2>核心</h2>
    <p>
      按国战备战分为激励为导向来分配，堡垒一共八期，会逐渐汇聚到 521，最终 4
      要塞 8 堡垒
    </p>
    <h2>关于积分</h2>
    <p>
      积分组成由本赛季国战备战分大小号相加，共两次国战分相加。赛季前四期堡垒分配由第一次国战分决定，赛季后四期堡垒分配由第一次国战和第二次国战分相加决定。
    </p>
    <h2>关于分配奖励</h2>
    <p>
      所有分配均需在档才能参与，521
      的堡垒按照国战分进行档位分配。分配时间为周六凌晨或者上午，有排名的兄弟中午回家就行。非
      521
      的堡垒按照先来先得原则进行分配。分配时间为周五晚上跑完堡垒后，如果和打熊冲突，优先打熊，分配时间待定可能推迟到周六
      0 点
    </p>
    <h2>关于堡垒集结</h2>
    <p>
      当期国战备战碾压胜利（总积分大于 5
      亿），有档位人员都能参加，参与集结需要飞到相应堡垒附近，由积分前五开车，超过
      15 人可以去下一个堡垒等待，多人上车拼手速。
    </p>
    <p>
      当期国战备战激烈，由当期上分前 15 参加集结，如果 3
      分钟后人凑不齐，排名后面的兄弟可以上车补齐。
    </p>
    <h2>关于堡垒胜利奖</h2>
    <p>
      521
      优先国战有排名吃，如果有排名因联盟人满进不来，会踢掉无档位里的最后一个位置。非
      521 的胜利奖全区都能进
    </p>
  </div>
);
